nxp-mcuxpresso/mcux-sdk-examples/evkmimxrt1170/lwip_examples/lwip_ipv4_ipv6_echo/freertos/cm7/pin_mux.h
/*
 * Copyright 2022-2023 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M7F */

/* GPIO_LPSR_12 (coord U5), PHY_RESET */
/* Routed pin properties */
#define BOARD_INITENETPINS_PHY_RESET_PERIPHERAL                           GPIO12   /*!< Peripheral name */
#define BOARD_INITENETPINS_PHY_RESET_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITENETPINS_PHY_RESET_CHANNEL                                 12U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITENETPINS_PHY_RESET_GPIO                                 GPIO12   /*!< GPIO peripheral base pointer */
#define BOARD_INITENETPINS_PHY_RESET_GPIO_PIN                                12U   /*!< GPIO pin number */
#define BOARD_INITENETPINS_PHY_RESET_GPIO_PIN_MASK                   (1U << 12U)   /*!< GPIO pin mask */

/* GPIO_AD_12 (coord P17), PHY_INTR */
/* Routed pin properties */
#define BOARD_INITENETPINS_PHY_INTR_PERIPHERAL                             GPIO9   /*!< Peripheral name */
#define BOARD_INITENETPINS_PHY_INTR_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INITENETPINS_PHY_INTR_CHANNEL                                  11U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITENETPINS_PHY_INTR_GPIO                                   GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITENETPINS_PHY_INTR_GPIO_PIN                                 11U   /*!< GPIO pin number */
#define BOARD_INITENETPINS_PHY_INTR_GPIO_PIN_MASK                    (1U << 11U)   /*!< GPIO pin mask */

/* GPIO_DISP_B2_05 (coord C9), REF_CLK */
/* Routed pin properties */
#define BOARD_INITENETPINS_REF_CLK_PERIPHERAL                               ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_REF_CLK_SIGNAL                           enet_ref_clk   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitEnetPins(void);                /* Function assigned for the Cortex-M7F */

/* GPIO_DISP_B2_13 (coord A5), PHY_RESET */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_PHY_RESET_PERIPHERAL                         GPIO11   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_PHY_RESET_SIGNAL                            gpio_io   /*!< Signal name */
#define BOARD_INITENET1GPINS_PHY_RESET_CHANNEL                               14U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITENET1GPINS_PHY_RESET_GPIO                               GPIO11   /*!< GPIO peripheral base pointer */
#define BOARD_INITENET1GPINS_PHY_RESET_GPIO_PIN                              14U   /*!< GPIO pin number */
#define BOARD_INITENET1GPINS_PHY_RESET_GPIO_PIN_MASK                 (1U << 14U)   /*!< GPIO pin mask */

/* GPIO_DISP_B2_12 (coord B6), PHY_INTR */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_PHY_INTR_PERIPHERAL                           GPIO5   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_PHY_INTR_SIGNAL                         gpio_mux_io   /*!< Signal name */
#define BOARD_INITENET1GPINS_PHY_INTR_CHANNEL                                13U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitEnet1GPins(void);              /* Function assigned for the Cortex-M7F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
